zephyrproject-rtos/zephyr/drivers/serial/uart_esp32.c
/*
 * Copyright (c) 2019 Mohamed ElShahawi (extremegtx@hotmail.com)
 * Copyright (c) 2023-2026 Espressif Systems (Shanghai) Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT espressif_esp32_uart

/* Include esp-idf headers first to avoid redefining BIT() macro */
/* TODO: include w/o prefix */
#ifdef CONFIG_SOC_SERIES_ESP32
#include <esp32/rom/ets_sys.h>
#include <esp32/rom/gpio.h>
#include <soc/dport_reg.h>
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
#include <esp32s2/rom/ets_sys.h>
#include <esp32s2/rom/gpio.h>
#include <soc/dport_reg.h>
#elif defined(CONFIG_SOC_SERIES_ESP32S3)
#include <esp32s3/rom/ets_sys.h>
#include <esp32s3/rom/gpio.h>
#include <zephyr/dt-bindings/clock/esp32s3_clock.h>
#elif defined(CONFIG_SOC_SERIES_ESP32C2)
#include <esp32c2/rom/ets_sys.h>
#include <esp32c2/rom/gpio.h>
#include <zephyr/dt-bindings/clock/esp32c2_clock.h>
#elif defined(CONFIG_SOC_SERIES_ESP32C3)
#include <esp32c3/rom/ets_sys.h>
#include <esp32c3/rom/gpio.h>
#include <zephyr/dt-bindings/clock/esp32c3_clock.h>
#elif defined(CONFIG_SOC_SERIES_ESP32C5)
#include <esp32c5/rom/ets_sys.h>
#include <esp32c5/rom/gpio.h>
#include <zephyr/dt-bindings/clock/esp32c5_clock.h>
#elif defined(CONFIG_SOC_SERIES_ESP32C6)
#include <esp32c6/rom/ets_sys.h>
#include <esp32c6/rom/gpio.h>
#include <zephyr/dt-bindings/clock/esp32c6_clock.h>
#elif defined(CONFIG_SOC_SERIES_ESP32H2)
#include <esp32h2/rom/ets_sys.h>
#include <esp32h2/rom/gpio.h>
#include <zephyr/dt-bindings/clock/esp32h2_clock.h>
#elif defined(CONFIG_SOC_SERIES_ESP32P4)
#include <esp32p4/rom/ets_sys.h>
#include <esp32p4/rom/gpio.h>
#include <zephyr/dt-bindings/clock/esp32p4_clock.h>
#endif
#ifdef CONFIG_UART_ASYNC_API
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_esp32.h>
#include <zephyr/cache.h>
#include <hal/uhci_ll.h>
#if defined(CONFIG_SOC_SERIES_ESP32C5)
#define UHCI0 UHCI
#endif
#include <hal/gdma_ll.h>
#include <hal/gdma_hal.h>
#include <hal/dma_types.h>
#include <esp_memory_utils.h>
#include <soc/soc_caps.h>
#endif
#include <soc/uart_struct.h>
#include <hal/uart_ll.h>
#include <hal/uart_hal.h>
#include <hal/uart_types.h>
#include <esp_clk_tree.h>
#include <zephyr/drivers/pinctrl.h>

#include <soc/uart_reg.h>
#include <zephyr/device.h>
#include <soc.h>
#include <zephyr/drivers/uart.h>

#include <zephyr/drivers/interrupt_controller/intc_esp32.h>

#include <zephyr/drivers/clock_control.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/policy.h>
#ifdef CONFIG_PM
#include <power.h>
#include <zephyr/drivers/pinctrl/pinctrl_esp32_common.h>
#endif
#include <errno.h>
#include <zephyr/sys/util.h>
#include <esp_attr.h>

#if CONFIG_ESP32_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP && SOC_UART_SUPPORT_SLEEP_RETENTION
#define UART_SLEEP_RETENTION_ENABLED 1
#else
#define UART_SLEEP_RETENTION_ENABLED 0
#endif

#if UART_SLEEP_RETENTION_ENABLED
#include <hal/uart_periph.h>
#include <esp_private/sleep_retention.h>
#endif
#include <zephyr/logging/log.h>

LOG_MODULE_REGISTER(uart_esp32, CONFIG_UART_LOG_LEVEL);

/** Mask of all error-class UART interrupts. */
#define UART_ESP32_ERR_INTR_MASK                                               \
	(UART_INTR_PARITY_ERR | UART_INTR_FRAM_ERR | UART_INTR_BRK_DET |     \
	 UART_INTR_RXFIFO_OVF | UART_INTR_RS485_PARITY_ERR |                  \
	 UART_INTR_RS485_FRM_ERR | UART_INTR_RS485_CLASH)

struct uart_esp32_config {
	const struct device *clock_dev;
	const struct pinctrl_dev_config *pcfg;
	const clock_control_subsys_t clock_subsys;
	int irq_source;
	int irq_priority;
	int irq_flags;
	bool tx_invert;
	bool rx_invert;
#if CONFIG_UART_ASYNC_API
	const struct device *dma_dev;
	uint8_t tx_dma_channel;
	uint8_t rx_dma_channel;
	bool uhci_slip_tx;
	bool uhci_slip_rx;
#endif
};

#if CONFIG_UART_ASYNC_API
struct uart_esp32_async_data {
	struct k_work_delayable tx_timeout_work;
	const uint8_t *tx_buf;
	size_t tx_len;
	struct k_work_delayable rx_timeout_work;
	uint8_t *rx_buf;
	uint8_t *rx_next_buf;
	size_t rx_len;
	size_t rx_next_len;
	size_t rx_timeout;
	volatile size_t rx_counter;
	size_t rx_offset;
	uart_callback_t cb;
	void *user_data;
};
#endif

/* driver data */
struct uart_esp32_data {
	struct uart_config uart_config;
	uart_hal_context_t hal;
#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	uart_irq_callback_user_data_t irq_cb;
	void *irq_cb_data;
#endif
#if CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API || CONFIG_PM
	/** Error flags saved by the ISR before it clears the hardware.
	 *  Consumed and cleared by uart_err_check().
	 */
	uint32_t isr_error_flags;
	struct k_spinlock err_lock;
#endif
#if CONFIG_UART_ASYNC_API
	struct uart_esp32_async_data async;
	uhci_dev_t *uhci_dev;
	const struct device *uart_dev;
#endif
#ifdef CONFIG_PM
	uint8_t pm_lock_bits;
	bool pm_policy_state_on;
#endif
};

#if CONFIG_PM
#define TX_POLL       BIT(0)
#define TX_INT_STREAM BIT(1)
#define TX_ASYNC      BIT(2)
#define RX_INT        BIT(3)
#endif

#define UART_FIFO_LIMIT	    (UART_LL_FIFO_DEF_LEN)
#define UART_TX_FIFO_THRESH (CONFIG_UART_ESP32_TX_FIFO_THRESH)
#define UART_RX_FIFO_THRESH (CONFIG_UART_ESP32_RX_FIFO_THRESH)

#if CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API || CONFIG_PM
static void uart_esp32_isr(void *arg);
#endif

#if CONFIG_PM
static void uart_esp32_pm_policy_state_lock_get(const struct device *dev, uint8_t lock_bit)
{
	struct uart_esp32_data *data = dev->data;
	unsigned int key = irq_lock();

	data->pm_lock_bits |= lock_bit;

	if (!data->pm_policy_state_on) {
		data->pm_policy_state_on = true;
		pm_policy_state_all_lock_get();
	}

	irq_unlock(key);
}

static void uart_esp32_pm_policy_state_lock_put(const struct device *dev, uint8_t lock_bit)
{
	struct uart_esp32_data *data = dev->data;
	unsigned int key = irq_lock();

	data->pm_lock_bits &= ~lock_bit;

	if (data->pm_policy_state_on && !data->pm_lock_bits) {
		data->pm_policy_state_on = false;
		pm_policy_state_all_lock_put();
	}

	irq_unlock(key);
}
#endif

static int uart_esp32_poll_in(const struct device *dev, unsigned char *p_char)
{
	struct uart_esp32_data *data = dev->data;
	int inout_rd_len = 1;

	if (uart_hal_get_rxfifo_len(&data->hal) == 0) {
		return -1;
	}

