zephyrproject-rtos/zephyr/drivers/serial/uart_esp32.c
	/*
	 * Read actual transferred bytes from DMA descriptor.
	 * Direct LL calls used because this ISR context requires IRAM-safe code.
	 * Note: We SET rx_counter (not add) because the UART ISR also increments
	 * rx_counter on RXFIFO_FULL interrupts, and the DMA descriptor contains
	 * the authoritative byte count.
	 */
	desc = (dma_descriptor_t *)gdma_ll_rx_get_success_eof_desc_addr(dma_hal->dev,
									config->rx_dma_channel / 2);
	if (desc) {
		rx_bytes = desc->dw0.length;
	} else {
		/* Fallback to full buffer if descriptor unavailable */
		rx_bytes = data->async.rx_len;
	}

	data->async.rx_counter = data->async.rx_offset + rx_bytes;

	/*
	 * If buffer is not full and no timeout is configured, reload DMA to
	 * continue receiving into the same buffer. The timeout callback will
	 * handle notifications for partial data.
	 */
	if (data->async.rx_counter < data->async.rx_len &&
	    data->async.rx_timeout == SYS_FOREVER_US) {
		dma_reload(config->dma_dev, config->rx_dma_channel, 0,
			   (uint32_t)data->async.rx_buf + data->async.rx_counter,
			   data->async.rx_len - data->async.rx_counter);
		dma_start(config->dma_dev, config->rx_dma_channel);
		uhci_ll_rx_set_packet_threshold(data->uhci_dev,
						data->async.rx_len - data->async.rx_counter);
		irq_unlock(key);
		return;
	}

	/* Notify RX_RDY */
	sys_cache_data_flush_and_invd_range(data->async.rx_buf + data->async.rx_offset,
					    data->async.rx_counter - data->async.rx_offset);

	evt.type = UART_RX_RDY;
	evt.data.rx.buf = data->async.rx_buf;
	evt.data.rx.len = data->async.rx_counter - data->async.rx_offset;
	evt.data.rx.offset = data->async.rx_offset;

	if (data->async.cb && evt.data.rx.len) {
		data->async.cb(uart_dev, &evt, data->async.user_data);
	}

	data->async.rx_offset = 0;
	data->async.rx_counter = 0;

	/* Release current buffer */
	evt.type = UART_RX_BUF_RELEASED;
	evt.data.rx_buf.buf = data->async.rx_buf;
	if (data->async.cb) {
		data->async.cb(uart_dev, &evt, data->async.user_data);
	}

	/* Load next buffer and request another */
	data->async.rx_buf = data->async.rx_next_buf;
	data->async.rx_len = data->async.rx_next_len;
	data->async.rx_next_buf = NULL;
	data->async.rx_next_len = 0U;
	evt.type = UART_RX_BUF_REQUEST;
	if (data->async.cb) {
		data->async.cb(uart_dev, &evt, data->async.user_data);
	}

	/* Notify RX_DISABLED when there is no buffer */
	if (!data->async.rx_buf) {
#ifdef CONFIG_PM
		uart_esp32_pm_policy_state_lock_put(uart_dev, RX_INT);
#endif
		evt.type = UART_RX_DISABLED;
		if (data->async.cb) {
			data->async.cb(uart_dev, &evt, data->async.user_data);
		}
	} else {
		/* Reload DMA with new buffer */
		dma_reload(config->dma_dev, config->rx_dma_channel, 0, (uint32_t)data->async.rx_buf,
			   data->async.rx_len);
		dma_start(config->dma_dev, config->rx_dma_channel);
		uhci_ll_rx_set_packet_threshold(data->uhci_dev, data->async.rx_len);
	}

	irq_unlock(key);
}

static void IRAM_ATTR uart_esp32_dma_tx_done(const struct device *dma_dev, void *user_data,
					     uint32_t channel, int status)
{
	const struct device *uart_dev = user_data;
	struct uart_esp32_data *data = uart_dev->data;
	struct uart_event evt = {0};
	unsigned int key = irq_lock();

	k_work_cancel_delayable(&data->async.tx_timeout_work);

	evt.type = UART_TX_DONE;
	evt.data.tx.buf = data->async.tx_buf;
	evt.data.tx.len = data->async.tx_len;
	if (data->async.cb) {
		data->async.cb(uart_dev, &evt, data->async.user_data);
	}

	/* Reset TX Buffer */
	data->async.tx_buf = NULL;
	data->async.tx_len = 0U;

#ifdef CONFIG_PM
	uart_esp32_pm_policy_state_lock_put(uart_dev, TX_ASYNC);
#endif

	irq_unlock(key);
}

static int uart_esp32_async_tx_abort(const struct device *dev)
{
	const struct uart_esp32_config *config = dev->config;
	struct uart_esp32_data *data = dev->data;
	struct dma_status dma_status = {0};
	struct uart_event evt = {0};
	size_t tx_sent;
	int err = 0;
	unsigned int key = irq_lock();

	k_work_cancel_delayable(&data->async.tx_timeout_work);

	/*
	 * Get actual transferred bytes from DMA status before stopping.
	 * This tells us how many bytes were actually sent before the abort.
	 */
	if (dma_get_status(config->dma_dev, config->tx_dma_channel, &dma_status) == 0) {
		tx_sent = dma_status.total_copied;
	} else {
		tx_sent = data->async.tx_len;
	}

	err = dma_stop(config->dma_dev, config->tx_dma_channel);
	if (err) {
		LOG_ERR("Error stopping Tx DMA (%d)", err);
		goto unlock;
	}

	evt.type = UART_TX_ABORTED;
	evt.data.tx.buf = data->async.tx_buf;
	evt.data.tx.len = tx_sent;

	if (data->async.cb) {
		data->async.cb(dev, &evt, data->async.user_data);
	}

#ifdef CONFIG_PM
	uart_esp32_pm_policy_state_lock_put(dev, TX_ASYNC);
#endif

unlock:
	irq_unlock(key);
	return err;
}

static void uart_esp32_async_tx_timeout(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct uart_esp32_async_data *async =
		CONTAINER_OF(dwork, struct uart_esp32_async_data, tx_timeout_work);
	struct uart_esp32_data *data = CONTAINER_OF(async, struct uart_esp32_data, async);

	uart_esp32_async_tx_abort(data->uart_dev);
}

static void uart_esp32_async_rx_timeout(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct uart_esp32_async_data *async =
		CONTAINER_OF(dwork, struct uart_esp32_async_data, rx_timeout_work);
	struct uart_esp32_data *data = CONTAINER_OF(async, struct uart_esp32_data, async);
	const struct uart_esp32_config *config = data->uart_dev->config;
	struct dma_status dma_status = {0};
	struct uart_event evt = {0};
	size_t rx_count;
	unsigned int key;

	/*
	 * Get actual transferred bytes from DMA descriptor.
	 * In DMA mode, data goes directly to memory via UHCI+GDMA, bypassing
	 * the UART FIFO. So rx_counter (updated by FIFO Full ISR) is not reliable.
	 * Instead, read total_copied from DMA status.
	 */
	if (dma_get_status(config->dma_dev, config->rx_dma_channel, &dma_status) == 0) {
		rx_count = dma_status.total_copied;
	} else {
		/* Fallback to rx_counter if DMA status unavailable */
		rx_count = data->async.rx_counter;
	}

