zephyrproject-rtos/zephyr/drivers/serial/uart_esp32.c
	data->async.rx_len = 0;
	data->async.rx_buf = NULL;

	/*Release next buffer*/
	if (data->async.rx_next_len) {
		evt.type = UART_RX_BUF_RELEASED;
		evt.data.rx_buf.buf = data->async.rx_next_buf;
		if (data->async.cb) {
			data->async.cb(dev, &evt, data->async.user_data);
		}

		data->async.rx_next_len = 0;
		data->async.rx_next_buf = NULL;
	}

#ifdef CONFIG_PM
	uart_esp32_pm_policy_state_lock_put(dev, RX_INT);
#endif

	/*Notify UART_RX_DISABLED*/
	evt.type = UART_RX_DISABLED;
	if (data->async.cb) {
		data->async.cb(dev, &evt, data->async.user_data);
	}

unlock:
	irq_unlock(key);
	return err;
}

#endif /* CONFIG_UART_ASYNC_API */

#if UART_SLEEP_RETENTION_ENABLED
static esp_err_t uart_create_sleep_retention_cb(void *arg)
{
	int port = (int)(uintptr_t)arg;
	sleep_retention_module_t module = uart_reg_retention_info[port].module;

	return sleep_retention_entries_create(uart_reg_retention_info[port].regdma_entry_array,
					      uart_reg_retention_info[port].array_size,
					      REGDMA_LINK_PRI_UART, module);
}

static void uart_esp32_sleep_retention_init(int port)
{
	if (port == CONFIG_ESP_CONSOLE_UART_NUM) {
		return;
	}

	sleep_retention_module_t module = uart_reg_retention_info[port].module;
	sleep_retention_module_init_param_t init_param = {
		.cbs = {.create = {.handle = uart_create_sleep_retention_cb,
				   .arg = (void *)(uintptr_t)port}},
		.attribute = SLEEP_RETENTION_MODULE_ATTR_ATTACH,
		.depends = RETENTION_MODULE_BITMAP_INIT(CLOCK_SYSTEM)};

	esp_err_t err = sleep_retention_module_init(module, &init_param);

	if (err == ESP_OK) {
		err = sleep_retention_module_allocate(module);
	}
	if (err == ESP_OK) {
		err = sleep_retention_module_attach(module);
	}
	if (err != ESP_OK) {
		LOG_WRN("UART%d sleep retention init failed (%d)", port, err);
	}
}
#endif

#if CONFIG_UART_ASYNC_API
static void uart_esp32_uhci_hw_init(const struct device *dev)
{
	struct uart_esp32_data *data = dev->data;
	const struct uart_esp32_config *config = dev->config;

	uhci_ll_init(data->uhci_dev);
	uhci_ll_rx_set_eof_mode(data->uhci_dev, UHCI_RX_IDLE_EOF | UHCI_RX_LEN_EOF);

	/*
	 * Clear the escape_conf reset defaults (all bits 1) first, then
	 * enable the C0 and DB escape pairs together as SLIP requires.
	 */
	data->uhci_dev->escape_conf.val = 0;
	data->uhci_dev->escape_conf.tx_c0_esc_en = config->uhci_slip_tx ? 1 : 0;
	data->uhci_dev->escape_conf.tx_db_esc_en = config->uhci_slip_tx ? 1 : 0;
	data->uhci_dev->escape_conf.rx_c0_esc_en = config->uhci_slip_rx ? 1 : 0;
	data->uhci_dev->escape_conf.rx_db_esc_en = config->uhci_slip_rx ? 1 : 0;

	uhci_ll_attach_uart_port(data->uhci_dev, uart_hal_get_port_num(&data->hal));
}
#endif

#ifdef CONFIG_PM
/*
 * Sleep switches every pad to its sleep configuration, which isolates
 * the pin and leaves it floating. With the UART RX line floating and
 * the peripheral still on, the receiver reads a constant low as a break
 * character and stores a null byte, while raising a pending interrupt
 * which stalls the driver/system on wake. Holding the pads keeps the
 * lines at their idle level, avoiding this problem.
 */
static void uart_esp32_sleep_hold_pins(const struct device *dev)
{
	const struct uart_esp32_config *config = dev->config;
	const struct pinctrl_state *state;

	if (pinctrl_lookup_state(config->pcfg, PINCTRL_STATE_DEFAULT, &state) < 0) {
		return;
	}

	for (uint8_t i = 0; i < state->pin_cnt; i++) {
		esp32_sleep_gpio_hold_config(ESP32_PIN_NUM(state->pins[i].pinmux), true);
	}
}
#endif

static int uart_esp32_pm_action(const struct device *dev, enum pm_device_action action)
{
	const struct uart_esp32_config *config = dev->config;
	int ret;

	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
#if CONFIG_UART_ASYNC_API && CONFIG_ESP32_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP
		/*
		 * UHCI has no sleep-retention link and is reset when the peripheral
		 * power domain is powered down. Re-apply configuration on wake.
		 */
		if (config->dma_dev != NULL) {
			uart_esp32_uhci_hw_init(dev);
		}
#endif
		break;

	case PM_DEVICE_ACTION_SUSPEND:
		break;

	case PM_DEVICE_ACTION_TURN_ON:

		ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
		if (ret) {
			LOG_ERR("Failed to configure UART pins (%d)", ret);
			return ret;
		}

#ifdef CONFIG_PM
		uart_esp32_sleep_hold_pins(dev);
#endif

#if UART_SLEEP_RETENTION_ENABLED
		struct uart_esp32_data *data = dev->data;

		uart_esp32_sleep_retention_init(uart_hal_get_port_num(&data->hal));
#endif
		break;

	case PM_DEVICE_ACTION_TURN_OFF:
		break;

	default:
		return -ENOTSUP;
	}

	return 0;
}

static int uart_esp32_init(const struct device *dev)
{
	int ret;
	struct uart_esp32_data *data = dev->data;
	const struct uart_esp32_config *config = dev->config;

	ret = pm_device_driver_init(dev, uart_esp32_pm_action);
	if (ret < 0) {
		return ret;
	}

	if (!device_is_ready(config->clock_dev)) {
		return -ENODEV;
	}

	clock_control_on(config->clock_dev, config->clock_subsys);
	uart_ll_sclk_enable(data->hal.dev);

	ret = uart_esp32_configure(dev, &data->uart_config);
	if (ret < 0) {
		LOG_ERR("Error configuring UART (%d)", ret);
		return ret;
	}

#if CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API || CONFIG_PM
	ret = esp_intr_alloc(config->irq_source,
			     ESP_PRIO_TO_FLAGS(config->irq_priority) |
				     ESP_INT_FLAGS_CHECK(config->irq_flags) | ESP_INTR_FLAG_IRAM,
			     (intr_handler_t)uart_esp32_isr, (void *)dev, NULL);
	if (ret < 0) {
		LOG_ERR("Error allocating UART interrupt (%d)", ret);
		return ret;
	}
#endif
#if CONFIG_UART_ASYNC_API
	if (config->dma_dev) {
		if (!device_is_ready(config->dma_dev)) {
			LOG_ERR("DMA device is not ready");
			return -ENODEV;
		}

		clock_control_on(config->clock_dev, (clock_control_subsys_t)ESP32_UHCI0_MODULE);
		uart_esp32_uhci_hw_init(dev);
		data->uart_dev = dev;

		k_work_init_delayable(&data->async.tx_timeout_work, uart_esp32_async_tx_timeout);
		k_work_init_delayable(&data->async.rx_timeout_work, uart_esp32_async_rx_timeout);
	}
#endif
	return 0;
}

static DEVICE_API(uart, uart_esp32_api) = {
	.poll_in = uart_esp32_poll_in,
	.poll_out = uart_esp32_poll_out,
	.err_check = uart_esp32_err_check,
#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
	.configure = uart_esp32_configure,
	.config_get = uart_esp32_config_get,
#endif
#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	.fifo_fill = uart_esp32_fifo_fill,
	.fifo_read = uart_esp32_fifo_read,
	.irq_tx_enable = uart_esp32_irq_tx_enable,
	.irq_tx_disable = uart_esp32_irq_tx_disable,
	.irq_tx_ready = uart_esp32_irq_tx_ready,
	.irq_rx_enable = uart_esp32_irq_rx_enable,
	.irq_rx_disable = uart_esp32_irq_rx_disable,
	.irq_tx_complete = uart_esp32_irq_tx_complete,
	.irq_rx_ready = uart_esp32_irq_rx_ready,
	.irq_err_enable = uart_esp32_irq_err_enable,
	.irq_err_disable = uart_esp32_irq_err_disable,
	.irq_is_pending = uart_esp32_irq_is_pending,
	.irq_update = uart_esp32_irq_update,
	.irq_callback_set = uart_esp32_irq_callback_set,
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */
#if CONFIG_UART_ASYNC_API
	.callback_set = uart_esp32_async_callback_set,
	.tx = uart_esp32_async_tx,
	.tx_abort = uart_esp32_async_tx_abort,
	.rx_enable = uart_esp32_async_rx_enable,
	.rx_buf_rsp = uart_esp32_async_rx_buf_rsp,
	.rx_disable = uart_esp32_async_rx_disable,
#endif /*CONFIG_UART_ASYNC_API*/
};

#if CONFIG_UART_ASYNC_API
#define ESP_UART_DMA_INIT(n)                                                                       \
	.dma_dev = ESP32_DT_INST_DMA_CTLR(n, tx),                                                  \
	.tx_dma_channel = ESP32_DT_INST_DMA_CELL(n, tx, channel),                                  \
	.rx_dma_channel = ESP32_DT_INST_DMA_CELL(n, rx, channel),                                  \
	.uhci_slip_tx = DT_INST_PROP_OR(n, uhci_slip_tx, false),                                   \
	.uhci_slip_rx = DT_INST_PROP_OR(n, uhci_slip_rx, false)

#define ESP_UART_UHCI_INIT(n)                                                                      \
	.uhci_dev = COND_CODE_1(DT_INST_NODE_HAS_PROP(n, dmas), (&UHCI0), (NULL))

#else
#define ESP_UART_DMA_INIT(n)
#define ESP_UART_UHCI_INIT(n)
#endif

